Revit 2027 API
ParameterTypeId.FabricationVendor Property
 "Vendor"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationVendor { get; }
Public Shared ReadOnly Property FabricationVendor As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationVendor {
	ForgeTypeId^ get ();
}
static member FabricationVendor : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace